# 판다스(Pandas)

# 1. 시리즈(Series)

## 1) 생성 및 조회

<table>
    <thead>
        <tr>
            <th>이름</th><th>나이</th><th>키</th>
        </tr>
    </thead>
    <tbody>
        <tr><td>김영철</td><td>24</td><td>179.4</td></tr>
        <tr><td>송윤지</td><td>31</td><td>161.0</td></tr>
        <tr><td>임수현</td><td>26</td><td>174</td></tr>
    </tbody>
</table>

### (1) 데이터만 생성

In [38]:
import pandas as pd

data = {
    "이름": ["철수", "영희", "민수"],
    "나이": [25, 30, 28]
}
df = pd.DataFrame(data)

print(df)

   이름  나이
0  철수  25
1  영희  30
2  민수  28

In [39]:
name_data = pd.Series(data=["김영철","송윤지","임수현"])
print(name_data)

0    김영철
1    송윤지
2    임수현
dtype: object

In [40]:
age_data = pd.Series(data=[24, 31, 26])
print(age_data)

0    24
1    31
2    26
dtype: int64

In [41]:
height_data = pd.Series(data=[179.4, 161.0,174])
print(height_data)

0    179.4
1    161.0
2    174.0
dtype: float64

### (2) 인덱스와 함께 생성

In [42]:
age_data = pd.Serise(
data = [24, 31 ,26],
index =["김영철","송윤지","임수현"])

print(age_data)

AttributeError: module 'pandas' has no attribute 'Serise'

In [ ]:
print(age_data.index)

In [ ]:
print(age_data.values)
print(type(age_data.values))

In [ ]:
data1 = pd.Seres(data=[10, 20,30])
data2 =pd.Seres(data=[1, 2,3])

## 2) 연산

## 3) 결측치

In [ ]:
# pandas ass
pd.Series([ 1, np.nan])


data1 = pd.Seres(data=[10, 20,30])
data2 = pd.Seres(data=[1,2,3])

data3 = data1 + data2
print(data3)

### (1) 결측치 발생

예제
* 데이터가 10, 20, 30인 시리즈 생성, 인덱스는 부산, 울산, 대구으로 설정
* 데이터가 1, 2, 3, 4인 시리즈 생성, 인덱스는 광주, 부산, 울산, 대구으로 설정
* 데이터의 덧셈

In [ ]:
data1 = pd.Series(data=[10, 20,30]
,index= ["부산", "부산", " 울산"])
data2 = pd.Series(data=[1, 2,3]
,index = ["광주", "부산", " 울산"])


data3 = data1 + data2
print(data1)
print(data2)
print(data3)

### (2) 결측치 파악

In [ ]:
data3.isna()

### (3) 결측치 채우기

In [ ]:
#결측치 채우기
data3.fillna()

### (4) 결측치 삭제

In [ ]:
data3.dropna()

In [ ]:
data3.dropna(inplace=True)

In [ ]:
data3

## 4) 통계

예제. 문자 데이터

```
['HR', 'Engineering', 'HR', 'Engineering', 'HR', 'Marketing', 'Engineering', 'Marketing', 'HR']
```

In [ ]:
data = pd.Series(
    ['HR', 'Engineering', 'HR', 'Engineering', 'HR', 'Marketing', 'Engineering', 'Marketing', 'HR']
)
data.describe()

In [ ]:
import pandas as pd

data = pd.Series(
    data =[10, 20, 30],
    index = ['부산', '울산', '대구']
)
data

In [ ]:
print(data.min())
print(data.mean())
print(data.var())
print(data.std())
print(data.max())

In [ ]:
data.describe()

# 2. 데이터프레임(DataFrame)

## 1) 생성

<table>
    <thead>
        <tr>
            <th>이름</th><th>성별</th><th>나이</th><th>키</th>
        </tr>
    </thead>
    <tbody>
        <tr><td>김영철</td><th>M</th><td>24</td><td>179.4</td></tr>
        <tr><td>송윤지</td><th>F</th><td>31</td><td>161.0</td></tr>
        <tr><td>임수현</td><th>F</th><td>26</td><td>174</td></tr>
    </tbody>
</table>

## 2) 조회

In [ ]:
import pandas as pd

data_list = [
    ["김영철","M",24,179.4]
    ["송윤지",]
]
data1 - pd.DataFrame(data_list, columns=["이름", "성별", "나이", "키"])
#data1.

### (1) 이름으로 조회

#### 열 조회

In [ ]:
import pandas as pd

data_list = [
    ["김영철", "M", 24, 179.4],
    ["송윤지", "F", 31, 161.0],
    ["임수현", "F", 26, 174]
]

data1 = pd.DataFrame(data_list, columns=["이름", "성별", "나이", "키"])
data1

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [ ]:
data_col_dict = {
    "이름": ["김영철", "송윤지", "임수현"],
    "성별": ["M", "F", "F"],
    "나이": [24, 31, 26],
    "키": [179.4,161.0, 174]
}
data2 = pd.DataFrame(data_col_dict)
data2

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

#### 행 조회

In [ ]:
#행딕셔너리이용 
data_col_dict = [
    {"이름" : "김영철", "성별" : "M", "나이": 24, "키": 179.4},
    {"이름" : "송윤지", "성별" : "F", "나이": 31, "키": 161.0},
    {"이름" : "임수현", "성별" : "F", "나이": 26, "키": 174}

]
data3 = pd.DataFrame(data_col_dict)
data3

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [ ]:
data4 = data1.set_index("이름")
data4

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

In [ ]:
data1["나이"]

0    24
1    31
2    26
Name: 나이, dtype: int64

In [ ]:
data4.loc["송윤지"]

성별        F
나이       31
키     161.0
Name: 송윤지, dtype: object

In [ ]:
data4.loc[["김영철","송윤지"]]

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0

In [ ]:
#임수현 학생의 키 조회 
data4.loc["임수현", "키"]

np.float64(174.0)

In [ ]:
#송윤지 학생의 성별 조회 
data4.loc["송윤지 ", "성별"]

KeyError: '송윤지 '

#### 셀 조회

### (2) 인덱스로 조회

#### 열 조회

In [ ]:
data1.iloc

#### 행 조회

In [ ]:
data4

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

In [ ]:
data4.loc[["김영철", "임수현"]]

    성별  나이      키
이름
김영철  M  24  179.4
임수현  F  26  174.0

In [ ]:
data4.iloc[1: 1]

Empty DataFrame
Columns: [성별, 나이, 키]
Index: []

In [ ]:
data4.columns

Index(['성별', '나이', '키'], dtype='object')

In [ ]:
#송윤지 학생의 데이터를 인덱스로 조회 
data4.iloc[1,:]

성별        F
나이       31
키     161.0
Name: 송윤지, dtype: object

In [ ]:
#송윤지, 임수현 학생의 데이터를 인덱스로 조회 
data4.iloc[1,:]

성별        F
나이       31
키     161.0
Name: 송윤지, dtype: object

In [ ]:
#임수현 학생의 성별을 인덱스로 조회
data4.iloc[2,0]

'F'

In [ ]:
#김영철 학생의 키를 인덱스로 조회 
data4.iloc[0,2]

np.float64(179.4)

In [ ]:
data1

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [ ]:
#성별이 M인 데이터 조회 : 조건식 data1["성별"]== "M"

data1.loc[data1["성별"]== "M"]

    이름 성별  나이      키
0  김영철  M  24  179.4

In [ ]:
,#성별이 M인 데이터들의 "키"를 조회하세요 
data1.loc[data1["성별"]== "M","키"]

In [ ]:
#키가 170이 넘는 사람들 조회 
data1.loc[data1["키"]>=170]

    이름 성별  나이      키
0  김영철  M  24  179.4
2  임수현  F  26  174.0

In [ ]:
#성별이 F이면서 키가 170 이상인 사람 조회 
#조건문을 만들 때 if 성별 == "F" and 키>= 170:
data1.loc[(data1["키"]>=170) & (data1["성별"]== "F")]

    이름 성별  나이      키
2  임수현  F  26  174.0

In [ ]:
# 위에 있는 데이터프레임을 직접 써서 생성해주세요
# 나이가 30이상인 데이터를 조회해주세요
# '이'씨 성을 가진 데이터를 조회해주세요
# 지역이 서울인 데이터를 조회해주세요
# 지역이 부산이고 '최'씨 성을 가진 사람의 나이를 조회해주세요

In [ ]:
import pandas as pd

data_list = [
    ["하정우", "M", 45, "부산"],
    ["이정재", "M", 50, "서울"],
    ["차은우", "M", 26, "전주"],
    ["최강희", "F", 34, "서울"]
]

actor = pd.DataFrame(data_list, columns=["이름", "성별", "나이", "지역"])
actor

    이름 성별  나이  지역
0  하정우  M  45  부산
1  이정재  M  50  서울
2  차은우  M  26  전주
3  최강희  F  34  서울

In [94]:
import pandas as pd

data_list = [
    ["하정우", "M", 45, "부산"],
    ["이정재", "M", 50, "서울"],
    ["차은우", "M", 26, "전주"],
    ["최강희", "F", 34, "서울"]
]

actor = pd.DataFrame(data_list, columns=["이름", "성별", "나이", "지역"])
actor

    이름 성별  나이  지역
0  하정우  M  45  부산
1  이정재  M  50  서울
2  차은우  M  26  전주
3  최강희  F  34  서울

In [ ]:
actor.loc[(actor["나이"]>30)]

    이름 성별  나이  지역
0  하정우  M  45  부산
1  이정재  M  50  서울
3  최강희  F  34  서울

In [ ]:
actor.loc[(actor["지역"]=="부산")]

    이름 성별  나이  지역
0  하정우  M  45  부산

In [ ]:
# '이'씨 성을 가진 데이터를 조회해주세요
actor[actor["이름"].str.startswith("이")]

    이름 성별  나이  지역
1  이정재  M  50  서울

#### 셀 조회

In [102]:
a = "나는 거지가 될거야 "

a.replace("거지", "부자")

'나는 부자가 될거야 '

In [110]:
a = [ 1, 4, 3, 6] 
b = a.pop()

print(b)

6

In [ ]:
# 지역이 부산이고 '최'씨 성을 가진 사람의 나이를 조회해주세요
actor.loc[(actor["지역"]=="부산") &(actor["이름"].str.startswith("최")),"나이"]

Series([], Name: 나이, dtype: int64)

### (3) 조건부 조회

## 3) 편집

### (1) 인덱스 제거

### (2) 데이터 병합

In [ ]:
data1 = pd.DataFrame(
    [["강남", 1, 2], ["서초", 4, 5], ["노원", 5, 6]],
    columns = ["지역명", "지점수", "매출"]
)
data1

  지역명  지점수  매출
0  강남    1   2
1  서초    4   5
2  노원    5   6

In [ ]:
data2 = pd.DataFrame(
    [["강남", 10, 20], ["도봉", 40, 50], ["노원", 50, 60]],
    columns = ["지역명", "지점수", "매출"]
)
data2

data1 + data2

    지역명  지점수  매출
0  강남강남   11  22
1  서초도봉   44  55
2  노원노원   55  66

In [ ]:
data1

  지역명  지점수  매출
0  강남    1   2
1  서초    4   5
2  노원    5   6

In [ ]:
#병합 
total_data = pd.merge(
    left=data1,
    right=data2,
    how="outer", # right, inner, outer
    on="지역명"
)
total_data

  지역명  지점수_x  매출_x  지점수_y  매출_y
0  강남    1.0   2.0   10.0  20.0
1  노원    5.0   6.0   50.0  60.0
2  도봉    NaN   NaN   40.0  50.0
3  서초    4.0   5.0    NaN   NaN

In [ ]:
total_data.info()
total_data.isna()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지역명     4 non-null      object
 1   지점수_x   3 non-null      float64
 2   매출_x    3 non-null      float64
 3   지점수_y   3 non-null      float64
 4   매출_y    3 non-null      float64
dtypes: float64(4), object(1)
memory usage: 288.0+ bytes

     지역명  지점수_x   매출_x  지점수_y   매출_y
0  False  False  False  False  False
1  False  False  False  False  False
2  False   True   True  False  False
3  False  False  False   True   True

In [ ]:
#각 열마다 결측치가 몆개 있는지 확인 
total_data.isna().sum(axis=0)

지역명      0
지점수_x    1
매출_x     1
지점수_y    1
매출_y     1
dtype: int64

In [ ]:
#결측치 채우기 
total_data.fillna(999)

  지역명  지점수_x   매출_x  지점수_y   매출_y
0  강남    1.0    2.0   10.0   20.0
1  노원    5.0    6.0   50.0   60.0
2  도봉  999.0  999.0   40.0   50.0
3  서초    4.0    5.0  999.0  999.0

In [ ]:
#결측치 삭제 -결측치가 하나라도 발행한 행은 삭제 
total_data.dropna()

  지역명  지점수_x  매출_x  지점수_y  매출_y
0  강남    1.0   2.0   10.0  20.0
1  노원    5.0   6.0   50.0  60.0

In [ ]:
#특정 열의 결측치 발생

In [ ]:
total_data.dropna(subset=["지점수_x"])

NameError: name 'total_data' is not defined

### (3) 결측치 처리

## 4) 통계

In [ ]:
total_data.describe()

          지점수_x      매출_x      지점수_y       매출_y
count  3.000000  3.000000   3.000000   3.000000
mean   3.333333  4.333333  33.333333  43.333333
std    2.081666  2.081666  20.816660  20.816660
min    1.000000  2.000000  10.000000  20.000000
25%    2.500000  3.500000  25.000000  35.000000
50%    4.000000  5.000000  40.000000  50.000000
75%    4.500000  5.500000  45.000000  55.000000
max    5.000000  6.000000  50.000000  60.000000

# 3. 실습

## 예제 1.

## 예제 2.

## 예제 3. 자동차 회사의연비 데이터

* manufacturer : 회사명
* cty : 도심연비
* hwy : 고속도로 연비

## 데이터 불러오기

In [ ]:
import pandas as pd 
mpg = pd.read_csv("../chan/mpg.csv")
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [ ]:
mpg.tail()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [ ]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  category      234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 20.2+ KB

In [51]:
mpg["manufacturer"].unique()

array(['audi', 'chevrolet', 'dodge', 'ford', 'honda', 'hyundai', 'jeep',
       'land rover', 'lincoln', 'mercury', 'nissan', 'pontiac', 'subaru',
       'toyota', 'volkswagen'], dtype=object)

In [52]:
mpg["manufacturer"].nunique()

15

In [44]:
#데이터가 몆 개이고, 열이 몆 개인가요?
nrow, ncol = mpg.shape
mpg.shape(f"mpg 데이터셋은 {nrow}개의 데이터와 {ncol}개의 열을 가지고 있습니다.")

TypeError: 'tuple' object is not callable

In [45]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

예제 1. cdata.csv 불러오기

In [47]:
import pandas as pd
han = pd.read_csv("../chan/cdata.csv", encoding = "CP949", index_col=0)
han

   Index   No  Age City
0      1  홍길동   25   서울
1      2  김준기   21   서울
2      9  이명식   22   부산
3     32  방준혁   24   광주
4     47  최명기   31   부산

예제 2. cdata_nohead.csv 불러오기

In [139]:
data = pd.read_csv("../chan/data_nohead.csv)
                    header = None   
                    index_col = 0 
                    names = ["index", "No", ""]
data

SyntaxError: unterminated string literal (detected at line 1) (513233733.py, line 1)

In [ ]:
#다른 유형의 데이터타입을 describe로 정리하고 싶을 때에는 어떻게 할까

## 데이터 파악하기

## Q1. 몇 개의 회사 데이터가 있나요?

In [55]:
n_manufacturer = mpg["manufacturer"].nunique()
print(f"A.{n_manufacturer}개의 회사가 있습니다")

A.15개의 회사가 있습니다

## Q2. 회사별로 참여한 자동차가 몇 대인지 파악하세요.

In [ ]:
#카테고리별 개수를 계산 

mpg["manufacturer"].value_counts()

# a = ["A", "A", "B", "C", "C", "", "C"]
# A가 몇개이고 B가 몇개이고 C가 몇개야?C

manufacturer
dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
Name: count, dtype: int64

In [65]:
# 미션. 데이터에서 "honda"회사의 데이터는 몇 개입니까?

manufacturer = mpg["manufacturer"].value_counts()

honda_count = manufacturer["honda"]
print(f"honda 회사의 데이터는 {honda_count}개 있습니다")

honda 회사의 데이터는 9개 있습니다

## Q3. 도심연비와 고속도로 연비를 평균낸 total 연비를 구하세요

In [69]:
mpg["total"] = (mpg["cty"] + mpg["hwy"]) / 2
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0

In [76]:
mpg.describe()

            displ         year         cyl         cty         hwy       total
count  234.000000   234.000000  234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171   20.149573
std      1.291959     4.509646    1.611534    4.255946    5.954643    5.050290
min      1.600000  1999.000000    4.000000    9.000000   12.000000   10.500000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000   15.500000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000   20.500000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000   23.500000
max      7.000000  2008.000000    8.000000   35.000000   44.000000   39.500000

In [75]:
mpg["total"] = (mpg["cty"] + mpg["hwy"]) / 2
mpg.tail()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5

## Q4. total 연비 상위 10개 회사의 회사별 개수를 구하세요

In [74]:
# 1. total열의 상위 10개 회사 추출 - 정렬
temp_data = mpg.sort_values(by=["total"], ascending=False)
temp_data

# 미션1. temp_data에서 맨 처음부터 10개의 데이터 가져오기
#temp_data2 = temp_data(10)
temp_data2 = temp_data.iloc[:10,:]
temp_data2.head()
# 미션2. temp_data2의 manufacturer의 종류와 개수 구하기(value_counts)
temp_data3 = temp_data2["manufacturer"].value_counts()
temp_data3

manufacturer
honda         4
volkswagen    3
toyota        3
Name: count, dtype: int64

In [ ]:
temp_data2 = temp_data

## +Quiz. 현대자동차의 평균 total 연비에 대한 평균값은?

In [93]:

import pandas as pd
# 1. 현대자동차(hyundai)의 데이터를 추출한다. hyundai_data 조건식 mpg["manufacturer"] == "hyundai"
hyundai_data = mpg[mpg["manufacturer"] == "hyundai"]
# 2. temp_data에서 total 열의 평균값을 계산한다.
hyundai_data_total_mean = hyundai_data["total"].mean()
print(f"현대자동차의 total열에 대한 평균값은 {hyundai_data_total_mean}입니다.")

현대자동차의 total열에 대한 평균값은 22.75입니다.

In [85]:
print(hyundai_data_total_mean)

22.75

In [89]:
# 1. total열의 평균값을 구한다. total_mean
total_mean = mpg["total"].mean()
print(total_mean)
# 2. total열과 total_mean을 비교한다.
# 3. PASS, FAIL을 판단한다.

20.14957264957265

In [88]:
mpg["result"] = np.where(mpg["total"] >= total_mean, "PASS", "FAIL")
mpg["result"].value_counts()

NameError: name 'np' is not defined

## Q5. 평균 total 연비보다 높은 자동차는 PASS, 낮은 자동차는 FAIL로 구분하세요.

In [ ]:

# 1. total열의 평균값을 구한다. total_mean
total_mean = mpg["total"].mean()
print(total_mean)
# 2. total열과 total_mean을 비교한다.
# 3. PASS, FAIL을 판단한다.
mpg["result"] = np.where(mpg["total"] >= total_mean, "PASS", "FAIL")
mpg["result"].value_counts()

20.14957264957265

NameError: name 'np' is not defined

## +Quiz. PASS인 자동차 중 가장 많은 숫자의 자동차 회사는?

In [ ]:
mpg
# 1. result값이 PASS인 데이터를 추출한다. pass_data
pass_data = mpg[mpg["result"]== "PASS"]
# 2. pass_data에서 manufacturer의 카테고리별 개수를 구한다.
pass__data["manufacturer"].value_counts()

4. 다양한 데이터 체험하기

In [133]:
#kr_raw.tsv(sep="\t") pd.read_csv()
#국민건강보험공단_.... xlsx
    #도구 설치 필요 uv add openpyx1
    #pd.read_excel()


# kowebs_c19_2024_beta.sav
    ## uv add pyreadstat
    ## pd.read__spss()

import pandas as pd

data6 = pd.read_csv("../chan/kr3_raw.tsv",sep= "\t")
data6

,Region,Rating,Category,Review
0,인덕원,1,삼겹살 고기집,숙성 돼지고기 전문점입니다. 건물 모양 때문에 매장 모양도 좀 특이하지만 쾌적한 편...
1,인덕원,1,삼겹살 고기집,고기가 정말 맛있었어요! 육즙이 가득있어서 너무 좋았아요\n일하시는분들 너무 친절하...
2,인덕원,1,순대국 찹쌀순대,"잡내없고 깔끔, 담백한 맛의 순대국이 순대국을 안 좋아하는 사람들에게도 술술 넘어갈..."
3,인덕원,1,순대국 찹쌀순대,고기 양이 푸짐해서 특 순대국밥을 시킨 기분이 듭니다~~ 맛도 좋습니다\n다만 양념...
4,인덕원,1,순대국 찹쌀순대,순대국 자체는 제가 먹어본 순대국밥집 중에서 Top5 안에는 들어요.\n\n그러나 ...
...,...,...,...,...
642408,평택,2,일식/중식/세계음식,"요즘, 핫하게,,,떠오르구 있는 중국집. ㅋ, 맥주의 여파루 속이 안좋지만 와봄. ..."
642409,평택,0,한식,원래 글 안쓰는데 이거는 정말 다른분들 위해서 써야할것같네요 방금 포장주문 해서 왔...
642410,평택,1,한식,"우리팀 단골집, 술먹고 다음 날 가면 푸짐하게 배불리 해장 할 수 있는곳, 주말도 ..."
642411,평택,2,카페/디저트,"원래는 평택에 있었는데, 연남동에도 최근에 생겨서 방문 했는데..진짜 줄이 어마어마..."
642412,평택,2,한식,친구들의 추천으로 가보게 된 곳. 안성과 평택 몇군데 위주로 체인점이 있는 소규모 ...

In [140]:
data7 = pd.read_excel("../chan/국민건강보험공단_특정 상병별 요양기관종별 및 진료과목별 및 시군구별 진료인원_20231231.xlsx,"sheet_name="Sheet5")

data7

SyntaxError: invalid syntax. Perhaps you forgot a comma? (285635546.py, line 1)